# Exercise 2.1 | Bivariate Relationships

In [1]:
# Imports
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

# Load Data
file_path = 'https://tayweid.github.io/econ-0150/parts/part-2-1/data/'

## Anscombe's Quartet

These four datasets have the same mean, standard deviation, and correlation.

In [3]:
# Load Anscombe's quartet (built into seaborn)
anscombe = sns.load_dataset('anscombe')
anscombe.head()

  dataset     x     y
0       I  10.0  8.04
1       I   8.0  6.95
2       I  13.0  7.58
3       I   9.0  8.81
4       I  11.0  8.33

In [4]:
# Summary statistics by dataset
anscombe.groupby('dataset').agg({'x': ['mean', 'std'], 'y': ['mean', 'std']})

           x                   y
        mean       std      mean       std
dataset
I        9.0  3.316625  7.500909  2.031568
II       9.0  3.316625  7.500909  2.031657
III      9.0  3.316625  7.500000  2.030424
IV       9.0  3.316625  7.500909  2.030579

## Coffee Production and GDP

Was the relationship between coffee production and GDP different in 1980?

In [21]:
gdp = pd.read_csv('data/' + 'Beans_GDP_1980.csv', index_col=0)
gdp.head()

    Code  Year  coffee_prod    Entity       GDP  population continent
10   AGO  1980     0.043260    Angola  0.028927        32.9    Africa
150  BOL  1980     0.020540   Bolivia  0.013809        11.7  Americas
209  BRA  1980     1.061195    Brazil  0.709314       211.0  Americas
268  BDI  1980     0.018894   Burundi  0.004061        11.9    Africa
377  CMR  1980     0.112207  Cameroon  0.020713        26.5    Africa

## Coffee and Oil Prices

But are the two prices positively or negatively related to each other?

In [13]:
prices = pd.read_csv(file_path + 'Coffee_Oil.csv')
prices.head()

   Year  Coffee     Oil
0  2001    0.88  153.73
1  2002    0.84  157.37
2  2003    0.95  181.32
3  2004    1.13  240.65
4  2005    1.54  342.88